Autodesk.Revit.DB.ElementRecord.GetBoundingBox
Gets the bounding box of the element record.
Returns:
The bounding box outline. null if there is no bounding box for this element.
Since:
2011

Autodesk.Revit.DB.ElementRecord.HasBoundingBox
Determines whether this element record has a bounding box.
Returns:
True if the element record has a bounding box or false otherwise.
Since:
2011

Autodesk.Revit.DB.ElementRecord.IsCurveDriven
Identifies if the element is curve driven.
Returns:
True if the element is curve driven.
Since:
2011

Autodesk.Revit.DB.ElementRecord.GetDesignOptionId
Gets the design option id of the element record.
Returns:
The design option id.
Since:
2011

Autodesk.Revit.DB.ElementRecord.GetOwnerViewId
Gets the element id of the owner view record.
Returns:
The view record element id.
Since:
2011

Autodesk.Revit.DB.ElementRecord.IsAnElementType
Identifies if the element record represents an ElementType.
Returns:
True if the element record represents an ElementType.
Since:
2011

Autodesk.Revit.DB.ElementRecord.GetCategoryId
Gets the category id of the element record.
Returns:
The category id.
Since:
2011

Autodesk.Revit.DB.ElementRecord.GetId
Gets the id of the element record.
Returns:
The element id.
Since:
2011

Autodesk.Revit.DB.ElementRecord.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ElementRecord.WorksetId
Get Id of the workset which owns the element.
Remarks:
Each element belongs to one and only one workset.
Since:
2011

Autodesk.Revit.DB.ElementRecord
A record in the Revit database representing an element.
Remarks:
The record is used to extract basic information about an element before
the element is fully expanded in memory.
Since:
2011